{
  "title": "What is SnowGem (XSG)?",
  "subtitle": "Equihash altcoin mining",
  "slug": "what-is-snowgem-xsg",
  "section": "",
  "url": "/news/what-is-snowgem-xsg/",
  "body": "## Introduction to SnowGem\r\n\r\nSnowGem (XSG) is a fork of ZCash (ZEC)... \r\n\r\nSnowGem Summary ||\r\n-|-\r\nName | SnowGem\r\nTicker | XSG\r\nAlgorithm | Equihash\r\nType | Proof of Work (PoW)\r\nSupply | 84,096,000\r\nBlock size | -\r\nBlock time | 1 minute\r\nBlock reward | \\*20 XSG\r\nBlock reward halving | Block 2102400\r\nICO | None\r\nPremine | None\r\nFounders Reward | 5% until first halving\r\n\r\n## SnowGem's technology\r\n\r\nSnowGem uses the equihash algorithm, which is an algorithm known for its ASIC (**A**pplication **S**pecific **I**ntegrated **C**ircuit) resistance. This means network hash is unlikely to be centralized with a few high-end ASIC miners. Anyone with a GPU or CPU can mine and receive XSG.\r\n\r\nThe other key piece of technology in use is zk-SNARKS, which allows transactions to be stored on the blockchain completely encrypted, while still allowsing for verification and validation. In simpler terms, transactions can be proved valid without revealing any information about them. This allows for anonymous transactions along side standard transparent transactions.\r\n\r\n## SnowGem's latest developments\r\n\r\n**Masternodes** recently went live and started paying out on the SnowGem network. At the time of writing there are over 150 across the  globe. Masternodes provide an alternative way to earn coins without having to mine them. Instead of buying mining equipment, you set up a masternode on small server, stake your coins (10,000 XSG) and watch the funds roll in. That's the simple version. Learn more about setting up masternodes on their [website](https://snowgem.org/how-to-setup-a-masternode/).\r\n\r\n## SnowGem team\r\n\r\nWhile there are regular contributors to the project, and a small group who might be considered the core developers , the \"team\" is completely decentralized. Anyone with the skills can contribute to the project. And they do, from all over the world. Contributions mainly come from volunteers, however bounties – funded by the community – are also offered for key work that is considered valuable and/or a high priority for the advancement of the SnowGem.\r\n\r\n## SnowGem community\r\n\r\nSpeaking of community, SnowGem has one of the friendliest you'll encounter in crypto.  It's active, open, and very accessible. In-fighting seems to be non-existent and trolling is minimal. It can be accessed on Slack, Discord and Telegram, with messages from the *#general*  chat shared across all three.\r\n\r\nWhile there are certainly more active members than others, it doesn't feel like anyone is \"in charge\". All decisions about the project are made by the community by voting on them via a proposal system. If there's no proposal or no vote in favour, it basically doesn't happen. Decisions are decentralized.\r\n\r\n## Mining SnowGem\r\n\r\nYou can [mine SnowGem on LamboMoon](https://lambomoon.club). For further options you can visit the SnowGem [website](https://snowgem.org). They also have a dedicated mining profitability calculator, which can be found [here](https://snowgem.org/calculator/). \r\n\r\nLike other smaller coins, network hash tends to end up consolidating on larger pools, which is bad for any cryptocurrency aiming for decentralization. Visit our page to learn a little more about the [importance of decentralized mining](https://lambomoon.club).\r\n\r\n## Trading SnowGem\r\n\r\nSnowGem is currently available on BTC-Alpha, Trade Satoshi, Stocks.exchange, Graviex and BarterDEX. It's also due to be listed on Coinbene in May 2018.\r\n\r\n## Thoughts on SnowGem\r\n\r\nOptional privacy, fast transactions and low fees all make SnowGem pretty appealing. The strong community, active development and growing list of features and services indicate a coin with great room to grow in value, as well as become more widely adopted. The high coin supply might not be appealing to some, but it certainly makes prices easier to reason about for microtransactions. Plus, it means that everyone in the world can own at least one XSG, which is inline with the spirit of the coin and community, which are both very inclusive.\r\n\r\n\r\n[Mine SnowGem with LamboMoon](https://lambomoon.club)|\r\n-|-\r\nLow difficulty|*stratum+tcp://lambomoon.club:3041*\r\nHigher difficulty|*stratum+tcp://lambomoon.club:3141*\r\nUsername|*SnowGem wallet address*\r\nPassword|*None*",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2018-05-03T07:18:22.526Z",
  "updated": "2018-05-03T11:42:59.010Z",
  "published": "2018-05-03T07:18:28.373Z",
  "contentType": "page",
  "id": "HJPaDEuaz"
}